#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/example-org-8039af/desafio-terraform/runs/run-VrdoghrKxpGzA3Gg

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_security_group.ssh_http: Refreshing state... [id=sg-02889369032f72f71]
aws_instance.server[0]: Refreshing state... [id=i-05803b5eadd562533]
aws_instance.server[1]: Refreshing state... [id=i-07e7e6bd28b091f85]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.server[0] has been deleted
  - resource "aws_instance" "server" {
      - ami                                  = "ami-04505e74c0741db8d" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:430003473303:instance/i-05803b5eadd562533" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-05803b5eadd562533" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "aws_key" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-026a1112842a91bbb" -> null
      - private_dns                          = "ip-172-31-28-140.ec2.internal" -> null
      - private_ip                           = "172.31.28.140" -> null
      - public_dns                           = "ec2-54-227-185-94.compute-1.amazonaws.com" -> null
      - public_ip                            = "54.227.185.94" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "permitir ssh e http",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0a94bb222fe0607e1" -> null
      - tags                                 = {
          - "Environment" = "prd"
          - "Name"        = "server-0"
          - "Provisioner" = "Terraform"
          - "Repo"        = "https://github.com/SelecaoGlobocom/leandro-sauwen"
        } -> null
      - tags_all                             = {
          - "Environment" = "prd"
          - "Name"        = "server-0"
          - "Provisioner" = "Terraform"
          - "Repo"        = "https://github.com/SelecaoGlobocom/leandro-sauwen"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "4f0456791b433eabc769b31d7f52331aaf651764" -> null
      - vpc_security_group_ids               = [
          - "sg-02889369032f72f71",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0e9c1a970a91b220f" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.server[1] has been deleted
  - resource "aws_instance" "server" {
      - ami                                  = "ami-04505e74c0741db8d" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:430003473303:instance/i-07e7e6bd28b091f85" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-07e7e6bd28b091f85" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "aws_key" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-06e89dd446dcd16bd" -> null
      - private_dns                          = "ip-172-31-28-189.ec2.internal" -> null
      - private_ip                           = "172.31.28.189" -> null
      - public_dns                           = "ec2-34-207-183-24.compute-1.amazonaws.com" -> null
      - public_ip                            = "34.207.183.24" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "permitir ssh e http",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0a94bb222fe0607e1" -> null
      - tags                                 = {
          - "Environment" = "prd"
          - "Name"        = "server-1"
          - "Provisioner" = "Terraform"
          - "Repo"        = "https://github.com/SelecaoGlobocom/leandro-sauwen"
        } -> null
      - tags_all                             = {
          - "Environment" = "prd"
          - "Name"        = "server-1"
          - "Provisioner" = "Terraform"
          - "Repo"        = "https://github.com/SelecaoGlobocom/leandro-sauwen"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "4f0456791b433eabc769b31d7f52331aaf651764" -> null
      - vpc_security_group_ids               = [
          - "sg-02889369032f72f71",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0e5bc417a31a25891" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elb.desafio will be created
  + resource "aws_elb" "desafio" {
      + arn                         = (known after apply)
      + availability_zones          = [
          + "us-east-1a",
        ]
      + connection_draining         = true
      + connection_draining_timeout = 400
      + cross_zone_load_balancing   = true
      + desync_mitigation_mode      = "defensive"
      + dns_name                    = (known after apply)
      + id                          = (known after apply)
      + idle_timeout                = 400
      + instances                   = (known after apply)
      + internal                    = (known after apply)
      + name                        = "elb-desafio-terraform"
      + security_groups             = (known after apply)
      + source_security_group       = (known after apply)
      + source_security_group_id    = (known after apply)
      + subnets                     = (known after apply)
      + tags                        = {
          + "Name" = "desafio-terraform-elb"
        }
      + tags_all                    = {
          + "Name" = "desafio-terraform-elb"
        }
      + zone_id                     = (known after apply)

      + health_check {
          + healthy_threshold   = 2
          + interval            = 30
          + target              = "HTTP:8080/"
          + timeout             = 3
          + unhealthy_threshold = 2
        }

      + listener {
          + instance_port     = 8080
          + instance_protocol = "http"
          + lb_port           = 80
          + lb_protocol       = "http"
        }
    }

  # aws_instance.server[0] will be created
  + resource "aws_instance" "server" {
      + ami                                  = "ami-04505e74c0741db8d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "aws_key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "prd"
          + "Name"        = "server-0"
          + "Provisioner" = "Terraform"
          + "Repo"        = "https://github.com/SelecaoGlobocom/leandro-sauwen"
        }
      + tags_all                             = {
          + "Environment" = "prd"
          + "Name"        = "server-0"
          + "Provisioner" = "Terraform"
          + "Repo"        = "https://github.com/SelecaoGlobocom/leandro-sauwen"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "4f0456791b433eabc769b31d7f52331aaf651764"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-02889369032f72f71",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.server[1] will be created
  + resource "aws_instance" "server" {
      + ami                                  = "ami-04505e74c0741db8d"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "aws_key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Environment" = "prd"
          + "Name"        = "server-1"
          + "Provisioner" = "Terraform"
          + "Repo"        = "https://github.com/SelecaoGlobocom/leandro-sauwen"
        }
      + tags_all                             = {
          + "Environment" = "prd"
          + "Name"        = "server-1"
          + "Provisioner" = "Terraform"
          + "Repo"        = "https://github.com/SelecaoGlobocom/leandro-sauwen"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "4f0456791b433eabc769b31d7f52331aaf651764"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-02889369032f72f71",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 3 estimated
           $34.704/mo +$34.704

```

</details>

*Pusher: @lsauwen, Action: `pull_request`*